# Задача №41. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая в данном массиве определит
# количество элементов, у которых два соседних и, при
# этом, оба соседних элемента меньше данного. Сначала
# вводится число N — количество элементов в массиве
# Далее записаны N чисел — элементы массива. Массив
# состоит из целых чисел.
# Ввод:                   Ввод:
# 5                       5
# 1 2 3 4 5               1 5 1 5 1
# Вывод:                  Вывод:
# 0                       2
# (каждое число вводится с новой строки)

n = int(input("Введите колличество элементов набора чисел: "))
arrayN = []
for i in range(n):
    arrayN.append(int(input(": ")))

count = 0
for i in range(1, len(arrayN) - 1):
    if arrayN[i] > arrayN[i + 1] and arrayN[i] > arrayN[i - 1]:
        count += 1

print(count)
